emacs/Emacs.org
#+title Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* System Package Configuration

#+begin_src emacs-lisp

  ;; Initialise package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialise use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

* UI Configuration

** Basic UI Configuration

#+begin_src emacs-lisp

  (setq inhibit-startup-message t) ; Start up on a blank screen instead of the startup message

  (scroll-bar-mode -1) ; Disable visible scrollbar
  (tool-bar-mode -1) ; Disable toolbar
  (tooltip-mode -1) ; Disable tooltips
  (set-fringe-mode 50) ; Add margins
  (menu-bar-mode -1) ; Disable menubar

  ;; Set up visible bell
  (setq visible-bell t)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook

                  shell-mode-hook
                  treemacs-mode-hook
                  lsp-treemacs-generic-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (column-number-mode)
  (global-display-line-numbers-mode t)

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Font Configuration

#+begin_src emacs-lisp

  (set-face-attribute 'default nil :font "Source Code Pro" :height 120)
  (set-face-attribute 'fixed-pitch nil :font "Source Code Pro" :height 120)
  (set-face-attribute 'variable-pitch nil :font "DejaVu sans" :height 120 :weight 'regular)

#+end_src

** Modeline

#+begin_src emacs-lisp

  (use-package all-the-icons)

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))

#+end_src

** Theme

#+begin_src emacs-lisp

  (use-package doom-themes)
  (load-theme 'doom-dracula t)

#+end_src
** Text Scaling

#+begin_src emacs-lisp

  (use-package hydra)

  (defhydra hydra-text-scale (:timeout 30)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

#+end_src

** Ivy
#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

#+end_src

*** Ivy Rich

#+begin_src emacs-lisp

  (use-package ivy-rich
    :after counsel
    :init
    (ivy-rich-mode 1))

#+end_src

** Counsel

#+begin_src emacs-lisp

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^

#+end_src

** Helpful

#+begin_src emacs-lisp

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

* Keybindings

#+begin_src emacs-lisp

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))

#+end_src

** General

https://github.com/noctuid/general.el

#+begin_src emacs-lisp :noweb yes

  (use-package general
    :config
    (general-create-definer q/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (q/leader-keys
      <<bookmarks>>
      <<open>>
      "c"  '(org-capture :which-key "capture")
      "p"  '(emms-pause :which-key "pause music")
      "t"  '(:ignore t :which-key "toggle")
      "te" '(emms-mode-line-toggle :which-key "emms modeline")
      "tt" '(counsel-load-theme :which-key "choose theme")
      "ts" '(hydra-text-scale/body :which-key "scale text")
      "s"  '(mu4e-update-mail-and-index :which-key "sync mail"))

    (general-define-key
     "C-M-n" 'counsel-switch-buffer
     "<pause>" 'emms-pause))

#+end_src

*** Bookmarks

#+begin_src emacs-lisp :noweb-ref bookmarks :tangle no

  "b"  '(:ignore t :which-key "bookmark")
  "bc" '(lambda ()
          (interactive)
          (browse-url "https://classroom.google.com/h")
          :which-key "classroom")
  "bd" '(lambda ()
          (interactive)
          (browse-url "https://discord.com/app")
          :which-key "discord")
  "bg" '(lambda ()
          (interactive)
          (browse-url "https://codeberg.org")
          :which-key "codeberg")
  "bm" '(lambda ()
          (interactive)
          (browse-url "https://moodle.ins-mediterrania.cat/login/index.php")
          :which-key "moodle")
  "bw" '(lambda ()
          (interactive)
          (browse-url "https://web.whatsapp.com")
          :which-key "whatsapp")

#+end_src

*** Open app

#+begin_src emacs-lisp :noweb-ref open :tangle no

  "o"  '(:ignore t :which-key "open")
  "oa"  '(org-agenda :which-key "agenda")
  "oe"  '(emms :which-key "emms")
  "of"  '(lambda ()
              (interactive)
              (start-process-shell-command "firefox" nil "firefox")
              :which-key "firefox")
  "om"  '(mu4e :which-key "mail")
  "os"  '(eshell :which-key "eshell")
  "ot"  '(term :which-key "term")

#+end_src

** Evil

#+begin_src emacs-lisp

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

* Org Mode
** Setup

#+begin_src emacs-lisp

  (defun q/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

#+end_src

** Font Setup

#+begin_src emacs-lisp

  (defun q/org-font-setup ()
    ;; Replace list hypens with dots
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "DejaVu sans" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed pitch in Org mode appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

#+end_src

