emacs/Emacs.org
** Company Mode

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** Projectile

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Projects")
      (setq projectile-project-search-path '("~/Projects")))
    (setq projectile-switch-project-acion #'projectile-dired))

#+end_src

** Magit

#+begin_src emacs-lisp

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

** Forge


#+begin_src emacs-lisp
  (use-package forge
    :after magit)

  (setq auth-sources '("~/.authinfo"))
#+end_src

* Terminals

** term-mode

#+begin_src emacs-lisp

  (use-package term
    :config
    (setq explicit-shell-file-name "bash")
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

** vterm-mode

https://github.com/akermu/emacs-libvterm

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000))

#+end_src

** eshell-mode

#+begin_src emacs-lisp

  (use-package exec-path-from-shell
    :config (exec-path-from-shell-initialize))

  (use-package eshell-git-prompt)

  (defun q/configure-eshell ()
    ;; Save command history
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size 10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell
    :hook (eshell-first-time-mode . q/configure-eshell)
    :config
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "zsh" "vim")))

    (eshell-git-prompt-use-theme 'powerline))

#+end_src

* Email

** Main configuration

#+begin_src emacs-lisp :noweb yes

  (use-package mu4e
    :ensure nil
    :load-path "/usr/share/emacs/site-lisp/mu4e/"
    :defer 20
    :config

    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)

    ;; Refresh mail using isync every 10 minutes
    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail/")

    (setq mu4e-contexts
          (list
           <<mail-contexts>>))

    (setq mu4e-bookmarks
          '((:name "Unread messages" :query "flag:unread AND NOT flag:trashed" :key ?u)
            (:name "All inboxes" :query "maildir:/^.*/Inbox/" :key ?i)
            (:name "Today's messages" :query "date:today..now" :key ?t)
            (:name "Last 7 days" :query "date:7d..now" :hide-unread t :key ?w)
            (:name "Messages with images" :query "mime:image/*" :key ?p)))

    (mu4e t))

#+end_src

** Personal account

#+begin_src emacs-lisp :noweb-ref mail-contexts :tangle no

  (make-mu4e-context
   :name "Personal"
   :match-func
   (lambda (msg)
     (when msg
       (string-prefix-p "/Personal" (mu4e-message-field msg :maildir))))
   :vars '((user-mail-address . "yijods@gmail.com")
           (user-full-name . "qucchia")
           (mu4e-drafts-folder . "/Personal/[Gmail]/Drafts")
           (mu4e-sent-folder . "/Personal/[Gmail]/Sent Mail")
           (mu4e-refile-folder . "/Personal/[Gmail]/All Mail")
           (mu4e-trash-folder . "/Personal/[Gmail]/Trash")
           (mu4e-maildir-shortcuts
            (:maildir "/Personal/Inbox"             :key ?i)
            (:maildir "/Personal/[Gmail]/Sent Mail" :key ?s)
            (:maildir "/Personal/[Gmail]/Trash"     :key ?b)
            (:maildir "/Personal/[Gmail]/Drafts"    :key ?d)
            (:maildir "/Personal/[Gmail]/All Mail"  :key ?a))))

#+end_src

** School account

#+begin_src emacs-lisp :noweb-ref mail-contexts :tangle no

  (make-mu4e-context
   :name "School"
   :match-func
   (lambda (msg)
     (when msg
       (string-prefix-p "/School" (mu4e-message-field msg :maildir))))
   :vars '((user-mail-address . "timothydavid.skipper@alumnat.ins-mediterrania.cat")
           (user-full-name . "Timothy D. Skipper")
           (mu4e-drafts-folder . "/School/[Gmail]/Drafts")
           (mu4e-sent-folder . "/School/[Gmail]/Sent Mail")
           (mu4e-refile-folder . "/School/[Gmail]/All Mail")
           (mu4e-trash-folder . "/School/[Gmail]/Trash")
           (mu4e-maildir-shortcuts
            (:maildir "/School/Inbox"             :key ?i)
            (:maildir "/School/[Gmail]/Sent Mail" :key ?s)
            (:maildir "/School/[Gmail]/Trash"     :key ?b)
            (:maildir "/School/[Gmail]/Drafts"    :key ?d)
            (:maildir "/School/[Gmail]/All Mail"  :key ?a))))

#+end_src

** Development account

#+begin_src emacs-lisp :noweb-ref mail-contexts :tangle no

  (make-mu4e-context
   :name "Development"
   :match-func
   (lambda (msg)
     (when msg
       (string-prefix-p "/Development" (mu4e-message-field msg :maildir))))
   :vars '((user-mail-address . "qucchia0@gmail.com")
           (user-full-name . "qucchia")
           (mu4e-drafts-folder . "/Development/[Gmail]/Drafts")
           (mu4e-sent-folder . "/Development/[Gmail]/Sent Mail")
           (mu4e-refile-folder . "/Development/[Gmail]/All Mail")
           (mu4e-trash-folder . "/Development/[Gmail]/Trash")
           (mu4e-maildir-shortcuts
            (:maildir "/Development/Inbox"             :key ?i)
            (:maildir "/Development/[Gmail]/Sent Mail" :key ?s)
            (:maildir "/Development/[Gmail]/Trash"     :key ?b)
            (:maildir "/Development/[Gmail]/Drafts"    :key ?d)
            (:maildir "/Development/[Gmail]/All Mail"  :key ?a))))

#+end_src

** Work account

#+begin_src emacs-lisp :noweb-ref mail-contexts :tangle no

  (make-mu4e-context
   :name "Work"
   :match-func
   (lambda (msg)
     (when msg
       (string-prefix-p "/Work" (mu4e-message-field msg :maildir))))
   :vars '((user-mail-address . "timothydskipper@gmail.com")
           (user-full-name . "Timothy D. Skipper")
           (mu4e-drafts-folder . "/Work/[Gmail]/Drafts")
           (mu4e-sent-folder . "/Work/[Gmail]/Sent Mail")
           (mu4e-refile-folder . "/Work/[Gmail]/All Mail")
           (mu4e-trash-folder . "/Work/[Gmail]/Trash")
           (mu4e-maildir-shortcuts
            (:maildir "/Work/Inbox"             :key ?i)
            (:maildir "/Work/[Gmail]/Sent Mail" :key ?s)
            (:maildir "/Work/[Gmail]/Trash"     :key ?b)
            (:maildir "/Work/[Gmail]/Drafts"    :key ?d)
            (:maildir "/Work/[Gmail]/All Mail"  :key ?a))))

#+end_src

* Other
** Typing Practise

#+begin_src emacs-lisp

  (use-package speed-type)
  (use-package typit)

#+end_src

** GhostText

Connect to the GhostText browser extension

#+begin_src emacs-lisp

  (use-package atomic-chrome)

#+end_src

** EMMS

#+begin_src emacs-lisp

  (use-package emms
    :config
    (emms-all)
    (emms-default-players)
    :custom
    (emms-source-file-default-directory "~/Music/"))

#+end_src

